import React from 'react';

export class Header extends React.Component {
    render() {
        return (
            <React.Fragment>
                <h1 id="0.">Зараки Кенпачи</h1>
                <p className="headerText">
                    <b>Имя:</b> Зараки Кенпачи ("Кенпачи из Зараки"), Кен-чан, "Бессмертный" <br/>
                    <b>Уровень сил:</b> 6-В <br/>
                    <b>Пол:</b> Мужской <br/>
                    <b>Классификация:</b> Шинигами, капитан 11-ого отряда Готей 13, особый военный потенциал <br/>
                    <b>Возраст:</b> Более тысячи лет <br/>
                    Капитан 11-го отряда Готэя 13. Живёт лишь с одной целью — сражаться, всё остальное считает
                    вторичным и незначительным. Несмотря на испытываемую радость от битвы, не видит разницы между
                    победой и поражением. Главное, по мнению Кэмпати, — это сам процесс схватки.
                </p>

            </React.Fragment>
        )
    }
}