import React from "react";

export class MainText extends React.Component {
    render() {
        return (
            <div className="wrapper">
            <div id="1." className="mainTextItem">
            <h3 className="mainTextItemTitle">1. Внешность</h3>
                <p>Очень высокий мускулистый мужчина с диким и агрессивным внешним видом,
                соответствующим его характеру. У него вытянутое лицо с выраженными скулами
                и надбровными дугами без бровей (которых не было и в детстве), длинные чёрные волосы и зелёные глаза.
                Одна из самых заметных черт его внешности — тонкий шрам, пересекающий левую часть лица от лба
                до подбородка, который нанесла ему Ячиру Унохана много лет назад.</p>
            <p>Зараки носит рваную по краям хаори, которую он снял с тела убитого им предыдущего капитана.
                Раньше он укладывал волосы в жесткие шипы и прикреплял на них маленькие колокольчики
                (сейчас они не такие жёсткие и без колокольчиков).
                Его правый глаз скрыт специально изготовленной для него повязкой, которая пожирает духовную силу
                и не даёт ему быть слишком сильным. Во время своего первого появления носил черную повязку с золотой
                каймой, ошейником и цепью вместо одного ремешка, которая позже сменилась на простую черную повязку
                с обычными ремешками. </p>
            <p>Через полтора года волосы Кенпачи отрастают до плеч. Он также перестаёт привязывать колокольчики.
                Повязка снова меняется. Исчезают ремни, меняется форма и появляется серая кайма по краям.
                Хаори, потерянная в битве, заменяется на новую, такую же изодранную.</p>
        </div>

        <div id="2." className="mainTextItem">
            <h3 className="mainTextItemTitle">2. Характер</h3>
            <p>Кенпачи известен как очень сильный боец, который стремится стать ещё сильнее.
                Зараки чувствует себя счастливым, только когда сражается.
                Он специально ограничивает свои силы и дает противнику фору, для того чтобы упиваться битвой
                как можно дольше. По его мнению, боль и смерть — это лишь цена, которую платят за наслаждение битвой.
                Несмотря на свою склонность к жестокости, Кенпачи обычно останавливает бой, если его противник
                серьёзно ранен и перестает сопротивляться, утверждая, что он не заинтересован в битве,
                где враг заведомо проиграл. Тем не менее, он не колеблясь убивает своего оппонента,
                если тот не собирается сдаваться, как это было с Канаме Тоусеном и Нойтрой Джилгой.</p>
            <p>Кенпачи придаёт большое значение своему имени. Титул Кенпачи говорит о его невероятной мощи.
                Во время битвы с Ичиго Куросаки Кенпачи вспоминает о том, как больно не иметь имени,
                как он сам прожил свои ранние годы безымянным. Это заставляет Зараки чувствовать себя виноватым за то,
                что его меч до сих пор не имеет собственного имени.[12] После этого Кенпачи пытается узнать личность
                своего меча.</p>
            <p>Очевидно, что в сражениях Кенпачи иногда противоречит собственной логике. С одной стороны,
                он стремится увеличить свою собственную силу. С другой стороны, Кенпачи запечатывает часть своей силы,
                чтобы наслаждаться битвой настолько долго, насколько это возможно. Несмотря на то, что он живёт ради
                битв, Зараки не лишен нормальных эмоций. Кенпачи и его лейтенант, Ячиру, близки ещё с момента первой
                встречи и относятся друг к другу, как отец и дочь (что делает Ячиру одной из немногих людей, которыми
                он дорожит). Несмотря на все это, как утверждают несколько человек, если кто-то из его подчиненных
                вмешается в его битву, то он убивает сначала их.</p>
            <p>Зараки выказывает уважение лишь тем противникам, которые могут его победить или заставить подойти
                к пределу силы. Впервые после сражения с Ячиру Уноханой Кенпачи проиграл в бою с Ичиго Куросаки,
                хотя тот, со своей стороны, тоже считает себя проигравшим. Кенпачи при встрече всегда вызывает
                его на матч-реванш, но неизменно получает отказ. Ичиго не разделяет мнения капитана одиннадцатого
                отряда о наслаждении битвами и потому не будет сражаться с ним повторно без веской причины.
                Тем не менее, Кенпачи все ещё намерен бросить ему вызов: Зараки очевидно показал это, когда помог
                Ичиго в битве против связанных, утверждая, что так он сделает Ичиго сильнее для «их последующей битвы».</p>
            <p>Кенпачи глубоко уважает Унохану. Она — единственный человек, которым он когда-либо восхищался.
                Сражаясь с ней, он впервые испытал наслаждение от боя, она была единственной, кто мог противостоять ему.
                Думая, что умрёт, так и не победив её, Кенпачи плачет. Однако, когда он одерживает верх над Уноханой,
                он кричит и просит её не умирать.</p>
            <p>Убив Унохану и узнав имя своего меча, Кенпачи хоть и сохраняет своё рвение сражаться, ни о чём не задумываясь,
                но становится несколько более спокойным и сосредоточенным. Он прислушивается к словам Нанао Исе и
                прекращает искать Ячиру самостоятельно, согласившись с тем, что лучше доверить это дело его отряду.
                Также он стал больше беспокоиться за Ячиру; когда он обнаружил, что она пропала, он сразу же приказал
                своим солдатам искать её.</p>
                <p>Уникальная причёска Кенпачи — результат привычки принимать ванну каждый день перед сном, что необходимо
                    для него из-за его сильного потоотделения. Моется он исключительно мылом — в том числе и волосы —
                    что делает их жёсткими. Ему это нравится, потому что это позволяет уложить волосы в его любимую причёску.
                    Однажды лейтенант первого отряда Чоуджиро Сасакибе предложил ему шампунь, и после этого волосы Кенпачи стали
                    мягкими, и он никак не мог сделать нормальную причёску. С тех пор Кенпачи недолюбливает лейтенанта.
                    Раньше Кенпачи цеплял колокольчики на волосы, что требовало некоторого времени.
                    Однажды он несколько часов не мог прикрепить колокольчик к верхнему шипу, и Юмичика предложил ему свою помощь,
                    но Кенпачи отказался, поскольку считал, что странно поручать кому-то другому укладку своих волос.</p>
                <p>Кенпачи считает, что веселье важнее работы. Например, он посылает Юмичику Аясегаву на борьбу со связными,
                    потому что он был единственным свободным старшим офицером: Ячиру была занята обедом, а Иккаку спал.</p>
                <p>В свободное время Кенпачи предпочитает поспать. В еде он неприхотлив, однако особенно ненавидит натто.</p>
        </div>
                <h3 className="mainTextItemTitle">3. История</h3>
                <div id="3." className="mainTextItem">
                    <p>Кенпачи долгое время не имел имени. Он был родом из Зараки, 80-го района северного Руконгая.
                        Район №80 был худшим, самым беззаконным районом Руконгая, полным воров и убийц (в то время как
                        район №1
                        был самым спокойным и законопослушным). Ещё в детстве Кенпачи подобрал меч с тела мёртвого
                        синигами
                        впоследствии наложил на асаучи отпечаток своей души, тем самым превратив его в свой духовный
                        меч.
                        ] Мальчик набрался опыта в искусстве фехтования и убил многочисленных противников.
                        Однажды он встретил Ячиру Унохану и сразился с ней. Это был первый бой, в котором он
                        почувствовал страх
                        и сражался с наслаждением, так как ему было скучно просто рубить противников, которые не были
                        способны
                        оказать ему достойного сопротивления. Он подсознательно подавлял свою силу, чтобы сражаться
                        дольше,
                        и в итоге проиграл. После их боя он начал восхищаться ею и хотел драться, как она.</p>
                    <p>Некоторое время спустя, уже будучи взрослым, он обнаружил маленькую девочку и назвал её Ячиру,
                        в память о единственном человеке, которым он когда-либо восхищался, после того, как она не
                        испугалась его меча.
                        Ячиру была родом из района №79, Кусаджиши. Её родителей убили за некоторое время, вероятно,
                        небольшое,
                        до их встречи. В тот день он взял себе имя Кенпачи, которое давалось сильнейшему синигами в
                        каждом поколении,
                        убившему больше всего врагов и выигравшему больше всего сражений.</p>
                    <p>Позже они встретились с Иккаку Мадараме и Юмичикой Аясегавой. Ячиру предупредила Иккаку,
                        что связываться с Зараки, когда он в хорошем настроении, было плохой идеей,
                        но Иккаку не воспринял предупреждение всерьёз. Когда Иккаку встретился с Кенпачи лицом к лицу,
                        духовная сила Зараки вызвала у него тревогу, однако он был счастлив, что получил настоящий
                        вызов.
                        Удар Кенпачи оставил земляной кратер под Иккаку, что несколько встревожило Юмичику.
                        Из-за огромной силы Кенпачи Иккаку был вынужден обороняться. Иккаку продолжал сражение, желая
                        сокрушить Кенпачи,
                        но только получал всё больше и больше ран, в то время как его соперник оставался нетронутым его
                        клинком.
                        В то время как Кенпачи отметил, что весело провёл время, он решил прикончить Иккаку одним ударом
                        и завершить
                        сражение.</p>
                    <p>Иккаку возмутился, когда Кенпачи просто ушёл, не прикончив его. Кенпачи сказал, что он не любит
                        добивать тех,
                        кто не может сражаться, и что он не обязан убивать Иккаку. Иккаку думал, что он издевается над
                        ним и потребовал,
                        чтобы Кенпачи убил его. Кенпачи потерял терпение и, схватив Иккаку, спросил его, почему он
                        просит о смерти,
                        когда он так любит сражаться. Кенпачи объяснил ему философию, которой должны следовать такие
                        люди, как они.
                        «Никогда не признавай поражение и не проси о смерти! Умри, а уже потом признавай своё поражение!
                        Если ты проиграл, но не умер, это просто означает, что тебе повезло! Если у тебя есть что-то в
                        голове,
                        постарайся выжить! Выжить, чтобы убить того, кто не смог убить тебя!» Затем Кенпачи улыбнулся и
                        заявил,
                        что он сражался в полную силу; то есть, Иккаку действительно очень повезло. Он сказал, что
                        Иккаку должен жить,
                        вернуться и попытаться убить его ещё раз. Когда Кенпачи пошёл прочь, Иккаку спросил, как его
                        зовут, и он ответил,
                        что его зовут Кенпачи из Зараки.</p>
                    <p>Некоторое время спустя Зараки убил Кенпачи Киганджоу, капитана одиннадцатого отряда, одним
                        ударом,
                        перед как минимум двумястами членами отряда, и тем самым получил его место.
                        После убийства Киганжоу Зараки стал одиннадцатым Кенпачи официально.</p>
                    <p>На следующий день после первого представления Зараки отряду, к нему подошли Иккаку и Юмичика,
                        которые уже до этого стали синигами и присоединились к отряду. Иккаку сказал Зараки, что он
                        вернулся,
                        как тот и предложил, и Кенпачи улыбнулся. Позже они вместе сражались с сильным пустым. В то
                        время как отряд проиграл,
                        Иккаку вступил в сражение с ним, но его остановил Кенпачи, который хотел сам его убить. После
                        того,
                        как пустой был убит, появилось ещё несколько, и Иккаку и Юмичика захотели присоединиться к бою.
                        Сначала Кенпачи был против, но потом осознал, что они были похожи на него и хотели сражаться
                        рядом с ним.
                        И тогда Кенпачи разрешил им присоединяться к его сражениям.</p>
                    <p>Вскоре после того, как Кенпачи присоединился к Готею 13, Генрюусай Шигекуни Ямамото заставил его
                        изучать кендо,
                        потому что он не получил какого либо формального образования в навыке фехтования.
                        Обычно это требовалось от кандидатов в капитаны, однако этот редкий способ получения поста —
                        испытание боем —
                        позволил Кенпачи обойти это требование. Однако на следующий день Совет 46 постановил прекратить
                        тренировки,
                        поскольку боялся, что если Кенпачи станет ещё сильнее и решит восстать против Общества душ, его
                        никто не сможет
                        остановить. Кенпачи ненавидел кендо, потому что сражения заканчиваются слишком быстро, когда он
                        его использует,
                        поэтому он обращается к нему только тогда, когда его собственная жизнь находится в
                        опасности.</p>
                </div>

                <h3 className="mainTextItemTitle">4. Оборудование</h3>
                <div id="4." className="mainTextItem">
                    <p><b>Поглощающая духовную энергию повязка</b>: Кенпачи носит повязку на правом глазу, главная
                        особенность
                        которой в том, что она постоянно поглощает его духовную энергию. Специально для него она была
                        изготовлена
                        учёными НИИ синигами. Кенпачи очень сильно любит сражаться, однако найти равного ему противника
                        весьма сложно,
                        поэтому он даёт своим оппонентам фору, ограничивая своё зрение и духовную силу, — чтобы не
                        побеждать слишком
                        быстро. За некоторое время до того, как отправиться в мир людей на задание,
                        касающееся исполняющих обязанности синигами, он сменяет повязку на новую, так как старую он
                        потерял в битве
                        с Сиеном Гранцем. Новая повязка в десять раз мощнее старой.</p>
                    <p><b>Колокольчики</b>: Чтобы дать противнику ещё большее преимущество в бою, Зараки носил небольшие
                        колокольчики
                        на каждом шипе своих волос. Их звон может услышать только тот, кто сконцентрирует свою духовную
                        силу настолько,
                        чтобы иметь возможность победить Зараки. Спустя 17 месяцев после поражения Айзена Кенпачи уже не
                        носит
                        колокольчики.</p>
                </div>

                <h3 className="mainTextItemTitle">5. Силы и способности</h3>
                <div id="5." className="mainTextItem">
                    <p>
                        {/*<img className="leftimg" src="img/k1.webp">*/}
                        <b>Мастер владения мечом</b>: Навыки владения мечом нынешний Кенпачи довёл практически до
                        совершенства ещё в то время,
                        когда жил в районе Зараки, славящимся своим беззаконием. Его сила позволяет ему свободно драться
                        одной рукой;
                        Кенпачи использует обе руки только когда сталкивается с противником, который в ином случае может
                        победить его,
                        например, с Нойтрой или Ичиго. Будучи капитаном одиннадцатого отряда, специализирующегося на
                        ближнем бою,
                        он является одним из самых опытных фехтовальщиков во всём Обществе душ.</p>

                    <p><b>Эксперт рукопашного боя</b>: Несмотря на то, что Зараки предпочитает сражаться на мечах, он
                        продемонстрировал
                        свои навыки боя без оружия. Он без особых проблем способен парировать атаки противника одной
                        рукой,
                        наносить мощные удары, а также непринуждённо швырять оппонентов в разные стороны. Кенпачи, даже
                        уставший и
                        раненый в бою, комбинируя фехтование и рукопашный бой, способен с лёгкостью расправиться с
                        несколькими солдатами
                        из ОТО, который, в частности, требует от своих воинов отличного владения Хакудой.</p>
                    <p>
                        {/*<img className="rightimg" src="img/k2.webp">*/}
                        <b>Нозараши</b>: Кенпачи подобрал клинок с тела убитого синигами. Уже в его детстве меч обрёл
                        свою форму.
                        Его клинок больше обычной катаны, по размерам он ближе к нодати, его цуба имеет крайне странную
                        форму
                        простирается к центру клинка, собираясь у его основания и больше похожа на синай. Рукоять меча
                        белая,
                        большая её часть завернута в бинты, как и ножны. Кенпачи очень долгое время не знал имени своего
                        духовного меча.
                        Он был единственным капитаном в Готее 13, который не достиг ни банкая, ни даже, как впоследствии
                        оказалось,
                        шикая. После сражения с Ичиго, Кенпачи захотел узнать больше о своем мече, чтобы стать сильнее.
                        Зангецу отметил, что из-за разлада Кенпачи с его мечом в бою они мешают друг другу.
                        Кенпачи не мог услышать крик своего меча. Из-за разлада Нозараши обладал небольшой духовной
                        энергией,
                        и его было легко повредить. Несмотря на то, что Нозараши выглядит сильно изношенным и на его
                        лезвии
                        множество сколов, он представляет собой крайне мощное оружие, примером чему может служить бой
                        Кенпачи с Ичиго,
                        когда капитан пробивает насквозь клинок Ичиго и позже одним взмахом разрушает близлежащие
                        здания.
                        Когда Кенпачи побеждает Рецу Унохану и пробуждает свою истинную силу, он, наконец, слышит голос
                        своего меча.</p>
                </div>

            </div>
        );
    }
}